
// most things taken from: https://github.com/neverlosecc/source2sdk/tree/cs2

#pragma pack(8)

// Alignment: 4
// Size: 0x49
enum loadout_positions_t : uint32_t
{ 
	LOADOUT_POSITION_INVALID = 0xffffffff,
	LOADOUT_POSITION_MELEE = 0x0,
	LOADOUT_POSITION_C4 = 0x1,
	LOADOUT_POSITION_FIRST_AUTO_BUY_WEAPON = 0x0,
	LOADOUT_POSITION_LAST_AUTO_BUY_WEAPON = 0x1,
	LOADOUT_POSITION_SECONDARY0 = 0x2,
	LOADOUT_POSITION_SECONDARY1 = 0x3,
	LOADOUT_POSITION_SECONDARY2 = 0x4,
	LOADOUT_POSITION_SECONDARY3 = 0x5,
	LOADOUT_POSITION_SECONDARY4 = 0x6,
	LOADOUT_POSITION_SECONDARY5 = 0x7,
	LOADOUT_POSITION_SMG0 = 0x8,
	LOADOUT_POSITION_SMG1 = 0x9,
	LOADOUT_POSITION_SMG2 = 0xa,
	LOADOUT_POSITION_SMG3 = 0xb,
	LOADOUT_POSITION_SMG4 = 0xc,
	LOADOUT_POSITION_SMG5 = 0xd,
	LOADOUT_POSITION_RIFLE0 = 0xe,
	LOADOUT_POSITION_RIFLE1 = 0xf,
	LOADOUT_POSITION_RIFLE2 = 0x10,
	LOADOUT_POSITION_RIFLE3 = 0x11,
	LOADOUT_POSITION_RIFLE4 = 0x12,
	LOADOUT_POSITION_RIFLE5 = 0x13,
	LOADOUT_POSITION_HEAVY0 = 0x14,
	LOADOUT_POSITION_HEAVY1 = 0x15,
	LOADOUT_POSITION_HEAVY2 = 0x16,
	LOADOUT_POSITION_HEAVY3 = 0x17,
	LOADOUT_POSITION_HEAVY4 = 0x18,
	LOADOUT_POSITION_HEAVY5 = 0x19,
	LOADOUT_POSITION_FIRST_WHEEL_WEAPON = 0x2,
	LOADOUT_POSITION_LAST_WHEEL_WEAPON = 0x19,
	LOADOUT_POSITION_FIRST_PRIMARY_WEAPON = 0x8,
	LOADOUT_POSITION_LAST_PRIMARY_WEAPON = 0x19,
	LOADOUT_POSITION_FIRST_WHEEL_GRENADE = 0x1a,
	LOADOUT_POSITION_GRENADE0 = 0x1a,
	LOADOUT_POSITION_GRENADE1 = 0x1b,
	LOADOUT_POSITION_GRENADE2 = 0x1c,

	IN_MOVERIGHT = 0x400,
	IN_ATTACK2 = 0x800,
	IN_RELOAD = 0x2000,
	IN_SPEED = 0x10000,
	IN_JOYAUTOSPRINT = 0x20000,
	IN_FIRST_MOD_SPECIFIC_BIT = 0x100000000,
	IN_USEORRELOAD = 0x100000000,
	IN_SCORE = 0x200000000,
	IN_ZOOM = 0x400000000,
	IN_JUMP_THROW_RELEASE = 0x800000000,
};

// Alignment: 4
// Size: 0x5
enum LifeState_t : uint8_t
{
	LIFE_ALIVE = 0x0,
	LIFE_DYING = 0x1,
	LIFE_DEAD = 0x2,
	LIFE_RESPAWNABLE = 0x3,
	LIFE_RESPAWNING = 0x4,
};

// Alignment: 1
// Size: 0x6
enum WaterLevel_t : uint8_t
{ 
	WL_NotInWater = 0x0,
	WL_Feet = 0x1,
	WL_Waist = 0x2,
	WL_Chest = 0x3,
	WL_FullyUnderwater = 0x4,
	WL_Count = 0x5,
};

enum Contents : uint64_t
{
	// from CBaseEntity::OnEntityEvent function offset 121 in CBaseEntity vtable
	CONTENTS_WATER = 0x8000,
	CONTENTS_SLIME = 0x10000,
};

// copied from source1
enum EntityEvent_t : uint32_t
{
	ENTITY_EVENT_WATER_TOUCH = 0,
	ENTITY_EVENT_WATER_UNTOUCH,
	ENTITY_EVENT_PARENT_CHANGED,
};

enum EntityFlag_t : uint32_t
{
    FL_ONGROUND = (1<<0), // At rest / on the ground
    FL_DUCKING = (1<<1),
    FL_WATERJUMP = (1<<2), // player jumping out of water
	// Unused 1<<3
	FL_UNKNOWN0 = (1<<4), // Something related to UserCmd
    FL_FROZEN = (1<<5), // Player is frozen for 3rd person camera
    FL_ATCONTROLS = (1<<6),
    FL_CLIENT = (1<<7), // Unsure
    FL_FAKECLIENT = (1<<8), // Unsure
	// Unused 1<<9
    FL_FLY = (1<<10),
    FL_UNKNOWN1 = (1<<11), // Something to do with CRevertSaved
	// Unused 1<<12
	// Unused 1<<13
    FL_GODMODE = (1<<14),
    FL_NOTARGET = (1<<15),
    FL_AIMTARGET = (1<<16),
	// Unused 1<<17
    FL_STATICPROP = (1<<18),
	// Unused 1<<19
    FL_GRENADE = (1<<20),
    FL_DONTTOUCH = (1<<22),
    FL_BASEVELOCITY = (1<<23),
    FL_WORLDBRUSH = (1<<24),
    FL_OBJECT = (1<<25),
    FL_ONFIRE = (1<<27),
    FL_DISSOLVING = (1<<28),
    FL_TRANSRAGDOLL = (1<<29),
    FL_UNBLOCKABLE_BY_PLAYER = (1<<30)
};

enum EntityEffect_t
{
	EF_BONEMERGE                    = 0x001,
	EF_BRIGHTLIGHT                  = 0x002,
	EF_DIMLIGHT                     = 0x004,
	EF_NOINTERP                     = 0x008,
	EF_NOSHADOW                     = 0x010,
	EF_NODRAW                       = 0x020,
	EF_NORECEIVESHADOW              = 0x040,
	EF_BONEMERGE_FASTCULL           = 0x080,
	EF_ITEM_BLINK                   = 0x100,	// blink an item so that the user notices it.
	EF_PARENT_ANIMATES              = 0x200,	// always assume that the parent entity is animating
	EF_MARKED_FOR_FAST_REFLECTION	= 0x400,	// marks an entity for reflection rendering when using $reflectonlymarkedentities material variable
	EF_NOSHADOWDEPTH                = 0x800,	// Indicates this entity does not render into any shadow depthmap
	EF_SHADOWDEPTH_NOCACHE          = 0x1000,	// Indicates this entity cannot be cached in shadow depthmap and should render every frame
	EF_NOFLASHLIGHT                 = 0x2000,
	EF_NOCSM                        = 0x4000,	// Indicates this entity does not render into the cascade shadow depthmap
	EF_MAX_BITS                     = 15
};

class Vector2D
{
public:
	float x;
	float y;
};

class Vector
{
public:
	float x;
	float y;
	float z;
};

typedef Vector QAngle;

class Vector4D
{
public:
	float x;
	float y;
	float z;
	float w;
};

class CInButtonState
{
public:
	virtual void *MaybeGetSchema();
	InputBitMask_t m_pButtonStates[3];
};

// Size: 0x4
class CUtlStringToken
{
public:
	uint32_t m_nHashCode;
};

// Alignment: 1
// Size: 0x28
class CNetworkVarChainer
{
public:
	uint8_t unknown0[0x20];
	int16_t m_PathIndex; 	// 0x20
	uint8_t unknown1[6];
};

class CCSPlayerPawn;

// Alignment: 1
// Size: 0x40
class CPlayerPawnComponent
{
public:
	virtual void *MaybeGetSchema();
	virtual int64_t *Unk0();
	virtual void *Unk1(char a2);
	virtual void MergedNullSub2();
	virtual int64_t Unk3();
	virtual int64_t Unk4();
	virtual void MergedNullSub5();
	virtual int64_t Unk6();
	virtual int64_t Unk7();
	virtual void PostThink();
	virtual char Unk9();
	virtual int64_t Unk10();
	virtual void MergedNullSub11();
	virtual void MergedNullSub12();
	virtual int32_t *Unk13(int32_t *outWorldGroupId);
	
	CNetworkVarChainer __m_pChainEntity; // 0x8
	CCSPlayerPawn *pawn; // 0x30
	uint8_t unknown0[6];
};

class CMoveData;

// Alignment: 14
// Size: 0x1b8
class CPlayer_MovementServices : public CPlayerPawnComponent
{
public:
	virtual void *MaybeGetSchema();
	virtual int64_t *Unk0();
	virtual void *Unk1(char a2);
	// virtual void MergedNullSub2();
	virtual int64_t Unk3();
	virtual int64_t Unk4();
	// virtual void MergedNullSub5();
	virtual int64_t Unk6();
	// virtual int64_t Unk7();
	// virtual void PostThink();
	// virtual char Unk9();
	virtual int64_t Unk10();
	// virtual void MergedNullSub11();
	// virtual void MergedNullSub12();
	virtual int32_t *Unk13(int32_t *outWorldGroupId);
	
	virtual void UpdateButtonState(void *ucmd);
	virtual void PlayerRunCommand(void *ucmd);
	virtual void ProcessMovement(CMoveData *mv);
	virtual int64_t Unk17(int64_t a2);
	virtual bool ReturnOne18();
	virtual void *ResetMoveData();
	virtual int64_t SetupMove(void *ucmd, CMoveData *mv);
	virtual int64_t FinishMove(void *ucmd, CMoveData *mv);
	virtual void SetPredictionRandomSeed(void *ucmd);
	virtual int64_t Unk23(void *ucmd, int64_t a2);
	virtual bool ReturnOne24();
	virtual void CheckMovingGround(double frametime);
	virtual bool ReturnZero26();
	virtual int64_t Unk27(int64_t a2, float a3, float a4, float a5, char a6);
	
	int32_t m_nImpulse; 	// 0x40
	CInButtonState m_nButtons; 	// 0x48
	uint64_t m_nQueuedButtonDownMask; 	// 0x68
	uint64_t m_nQueuedButtonChangeMask; 	// 0x70
	uint64_t m_nButtonDoublePressed; 	// 0x78
	uint32_t m_pButtonPressedCmdNumber[64]; 	// 0x80
	uint32_t m_nLastCommandNumberProcessed; 	// 0x180
	// assume ida pads correctly to 8 bytes :)
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint64_t m_nToggleButtonDownMask; 	// 0x188
	// MNetworkEnable
	// MNetworkBitCount "12"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "2048"
	// MNetworkEncodeFlags
	float m_flMaxspeed; 	// 0x190
	// MNetworkEnable
	float m_arrForceSubtickMoveWhen[4]; 	// 0x194
	float m_flForwardMove; 	// 0x198
	float m_flLeftMove; 	// 0x19c
	float m_flUpMove; 	// 0x1a0
	Vector m_vecLastMovementImpulses; 	// 0x1a4
	Vector m_vecOldViewAngles; 	// 0x1a4
	uint8_t unknown[8];
};

// Alignment: 14
// Size: 0x208
class CPlayer_MovementServices_Humanoid : public CPlayer_MovementServices
{
public:
	virtual void *MaybeGetSchema();
	virtual int64_t *Unk0();
	virtual void *Unk1(char a2);
	// virtual void MergedNullSub2();
	virtual int64_t Unk3();
	// virtual int64_t Unk4();
	// virtual void MergedNullSub5();
	// virtual int64_t Unk6();
	virtual int64_t Unk7();
	virtual void PostThink();
	virtual char Unk9();
	virtual int64_t Unk10();
	// virtual void MergedNullSub11();
	// virtual void MergedNullSub12();
	virtual int32_t *Unk13(int32_t *outWorldGroupId);
	
	// virtual void UpdateButtonState(void *ucmd);
	// virtual void PlayerRunCommand(void *ucmd);
	// virtual void ProcessMovement(CMoveData *mv);
	virtual int64_t Unk17(int64_t a2);
	// virtual bool ReturnOne18();
	// virtual void *ResetMoveData();
	// virtual int64_t SetupMove(void *ucmd, CMoveData *mv);
	// virtual int64_t FinishMove(void *ucmd, CMoveData *mv);
	// virtual void SetPredictionRandomSeed(void *ucmd);
	// virtual int64_t Unk23(void *ucmd, int64_t a2);
	virtual bool ReturnOne24();
	// virtual void CheckMovingGround(double frametime);
	// virtual bool ReturnZero26();
	// virtual int64_t Unk27(int64_t a2, float a3, float a4, float a5, char a6);
	
	virtual float FlPlayerFallDamage();
	virtual void UpdateCollisionBounds();
	virtual void UnkNull30();
	virtual int64_t GetLadderSurface();
	virtual void UpdateStepSound(int64_t psurface, const Vector &vecOrigin, const Vector &vecVelocity);
	virtual void PlayStepSound(Vector &vecOrigin, uint64_t psurface, float fvol);
	virtual void GetStepSoundVelocities( float *velwalk, float *velrun );
	virtual CCSPlayerPawn *SetStepSoundTime(int a2, bool a3);
	virtual int64_t MaybeGetFootstepEntry();
	virtual void UnkNull37();
	virtual void UnkNull38();
	
	float m_flStepSoundTime; 	// 0x1b8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkBitCount "17"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	// MNetworkEncodeFlags
	float m_flFallVelocity; 	// 0x1bc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bInCrouch; 	// 0x1c0
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32_t m_nCrouchState; 	// 0x1c4
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flCrouchTransitionStartTime; 	// 0x1c8
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bDucked; 	// 0x1cc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bDucking; 	// 0x1cd
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bInDuckJump; 	// 0x1ce
	Vector m_groundNormal; 	// 0x1d0
	float m_flSurfaceFriction; 	// 0x1dc
	CUtlStringToken m_surfaceProps; 	// 0x1e0
	uint8_t unknown2[12];
	int32_t m_nStepside; 	// 0x1f0
	int32_t m_iTargetVolume; 	// 0x1f4
	Vector m_vecSmoothedVelocity; 	// 0x1f8
	
	uint8_t unknown3[4];
};

// Alignment: 35
// Size: 0x13c0
class CCSPlayer_MovementServices : public CPlayer_MovementServices_Humanoid
{
public:
	virtual void *MaybeGetSchema();
	virtual int64_t *Unk0();
	virtual void *Unk1(char a2);
	// virtual void MergedNullSub2();
	virtual int64_t Unk3();
	// virtual int64_t Unk4();
	// virtual void MergedNullSub5();
	// virtual int64_t Unk6();
	// virtual int64_t Unk7();
	// virtual void PostThink();
	// virtual char Unk9();
	// virtual int64_t Unk10();
	// virtual void MergedNullSub11();
	// virtual void MergedNullSub12();
	virtual int32_t *Unk13(int32_t *outWorldGroupId);
	
	virtual void UpdateButtonState(void *ucmd);
	virtual void PlayerRunCommand(void *ucmd);
	virtual void ProcessMovement(CMoveData *mv);
	virtual int64_t Unk17(int64_t a2);
	// virtual bool ReturnOne18();
	virtual void *ResetMoveData();
	virtual int64_t SetupMove(void *ucmd, CMoveData *mv);
	virtual int64_t FinishMove(void *ucmd, CMoveData *mv);
	// virtual void SetPredictionRandomSeed(void *ucmd);
	virtual int64_t Unk23(void *ucmd, int64_t a2);
	// virtual bool ReturnOne24();
	virtual void CheckMovingGround(double frametime);
	// virtual bool ReturnZero26();
	// virtual int64_t Unk27(int64_t a2, float a3, float a4, float a5, char a6);
	
	virtual float FlPlayerFallDamage();
	// virtual void UpdateCollisionBounds();
	// virtual void UnkNull30();
	// virtual int64_t GetLadderSurface();
	virtual void UpdateStepSound(uint64_t psurface, const Vector &vecOrigin, const Vector &vecVelocity);
	// virtual void PlayStepSound(Vector &vecOrigin, uint64_t psurface, float fvol);
	// virtual void GetStepSoundVelocities( float *velwalk, float *velrun );
	// virtual CCSPlayerPawn *SetStepSoundTime(int a2, bool a3);
	virtual int64_t MaybeGetFootstepEntry();
	// virtual void UnkNull37();
	// virtual void UnkNull38();
	
	virtual void CSPlayStepSound( Vector &vecOrigin, uint64_t psurface, float fvol, bool force ); // psurface type is surfacedata_t *
	
	// MNetworkEnable
	float m_flMaxFallVelocity; 	// 0x208
	// MNetworkEnable
	// MNetworkEncoder
	Vector m_vecLadderNormal; 	// 0x20c
	// MNetworkEnable
	int32_t m_nLadderSurfacePropIndex; 	// 0x218
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	bool m_bAllowAutoMovement; 	// 0x21c
	// MNetworkEnable
	float m_flDuckAmount; 	// 0x220
	// MNetworkEnable
	float m_flDuckSpeed; 	// 0x224
	// MNetworkEnable
	bool m_bDuckOverride; 	// 0x228
	float m_flDuckOffset; 	// 0x22c
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkPriority "32"
	uint32_t m_nDuckTimeMsecs; 	// 0x230
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32_t m_nDuckJumpTimeMsecs; 	// 0x234
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	uint32_t m_nJumpTimeMsecs; 	// 0x238
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flLastDuckTime; 	// 0x23c
	uint8_t unknown3[8];
	Vector2D m_vecLastPositionAtFullCrouchSpeed; 	// 0x248
	bool m_duckUntilOnGround; 	// 0x250
	bool m_bHasWalkMovedSinceLastJump; 	// 0x251
	bool m_bInStuckTest; 	// 0x252
	uint64_t m_CachedGetPointContents[64][3]; 	// 0x258
	Vector m_CachedGetPointContentsPoint[64][3]; 	// 0x858
	uint8_t unknown4[6];
	float m_flStuckCheckTime[64][2]; 	// 0x1160
	int32_t m_nTraceCount; 	// 0x1360
	int32_t m_StuckLast; 	// 0x1364
	bool m_bSpeedCropped; 	// 0x1368
	int32_t m_nOldWaterLevel; 	// 0x136c
	float m_flWaterEntryTime; 	// 0x1370
	Vector m_vecForward; 	// 0x1374
	Vector m_vecLeft; 	// 0x1380
	Vector m_vecUp; 	// 0x138c
	Vector m_vecPreviouslyPredictedOrigin; 	// 0x1398
	bool m_bMadeFootstepNoise; 	// 0x13a4
	int32_t m_iFootsteps; 	// 0x13a8
	int32_t m_nRoundFootstepsMade; 	// 0x13ac
	// MNetworkEnable
	bool m_bOldJumpPressed; 	// 0x13b0
	// MNetworkEnable
	float m_flJumpUntil; 	// 0x13b4
	// MNetworkEnable
	float m_flJumpVel; 	// 0x13b8
	// MNetworkEnable
	float m_fStashGrenadeParameterWhen; 	// 0x13bc
};

// Alignment: 0
// Size: 0x78
class CCSPlayer_ParachuteServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	uint8_t unknown[0x38];
};

// Alignment: 1
// Size: 0x48
class CCSPlayer_BulletServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	int32_t m_totalHitsOnServer; 	// 0x40
	uint8_t unknown1[0x4];
};

class CHandle
{
public:
	int32_t handle;
};

// Alignment: 2
// Size: 0x50
class CCSPlayer_HostageServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	// MNetworkEnable
	CHandle m_hCarriedHostage; 	// 0x40
	// MNetworkEnable
	CHandle m_hCarriedHostageProp; 	// 0x44
	uint8_t unknown[8];
};

// Alignment: 1
// Size: 0xc8
class CCSPlayer_BuyServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	float m_flNextAutoBuyAmmoTime; 	// 0x40
	uint8_t unknown1[0x84];
};

// Alignment: 2
// Size: 0x58
class CCSPlayer_PingServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	float m_flPlayerPingTokens[5]; 	// 0x40
	// MNetworkEnable
	CHandle m_hPlayerPing; 	// 0x54
};

// Alignment: 5
// Size: 0x60
class CCSPlayer_RadioServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
	float m_flGotHostageTalkTimer; 	// 0x40
	float m_flDefusingTalkTimer; 	// 0x44
	float m_flC4PlantTalkTimer; 	// 0x48
	float m_flRadioTokenSlots[3]; 	// 0x4c
	bool m_bIgnoreRadio; 	// 0x58
};

// Alignment: 0
// Size: 0x40
class CCSPlayer_DamageReactServices //: public CPlayerPawnComponent
{
public:
	CPlayerPawnComponent pawnComponent;
};

// Size: 0x20
#pragma pack(16)
class CTransform
{
public:
	Vector m_vPosition;
	Vector4D m_orientation;
};
#pragma pack(8)

// Alignment: 2
// Size: 0x60
class CAttributeList // : public 
{
public:
	uint8_t unknown0[8];
	// MNetworkEnable
	// MNetworkTypeAlias "CUtlVector< CEconItemAttribute >"
	void *m_Attributes; 	// 0x8
	uint8_t unknown1[0x48];
	void *m_pManager; 	// 0x58 CAttributeManager
};

// Alignment: 13
// Size: 0x278
class CEconItemView // : public IEconItemInterface
{
public:
	uint8_t unknown0[0x38];
	// MNetworkEnable
	uint16_t m_iItemDefinitionIndex; 	// 0x38
	// MNetworkEnable
	int32_t m_iEntityQuality; 	// 0x3c
	// MNetworkEnable
	uint32_t m_iEntityLevel; 	// 0x40
	uint64_t m_iItemID; 	// 0x48
	// MNetworkEnable
	uint32_t m_iItemIDHigh; 	// 0x50
	// MNetworkEnable
	uint32_t m_iItemIDLow; 	// 0x54
	// MNetworkEnable
	uint32_t m_iAccountID; 	// 0x58
	// MNetworkEnable
	uint32_t m_iInventoryPosition; 	// 0x5c
	uint8_t unknown1[8];
	// MNetworkEnable
	bool m_bInitialized; 	// 0x68
	// MNetworkEnable
	CAttributeList m_AttributeList; 	// 0x70
	// MNetworkEnable
	CAttributeList m_NetworkedDynamicAttributes; 	// 0xd0
	// MNetworkEnable
	char m_szCustomName[161]; 	// 0x130
	char m_szCustomNameOverride[161]; 	// 0x1d1
	uint8_t unknown2[6];
};

// Size: 0x8
class IHandleEntity // : public 
{
public:
	virtual void *MaybeGetSchema();
	virtual uint64_t *IheUnk0(char a2);
	virtual int *IheUnk1(int *a2);
};

union CUtlSymbolLarge
{
public:
	int64_t m_Id;
	const char *m_pAsString;
};

// Alignment: 11
// Size: 0x78
class CEntityIdentity // : public 
{
public:
	uint8_t unknown0[0x14];
	// MNetworkEnable
	// MNetworkChangeCallback "entityIdentityNameChanged"
	int32_t m_nameStringableIndex; 	// 0x14
	CUtlSymbolLarge m_name; 	// 0x18
	CUtlSymbolLarge m_designerName; 	// 0x20
	uint8_t unknown1[8];
	uint32_t m_flags; 	// 0x30
	uint8_t unknown2[4];
	// MNetworkDisable
	int32_t m_worldGroupId; 	// 0x38
	uint32_t m_fDataObjectTypes; 	// 0x3c
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	int16_t m_PathIndex; 	// 0x40
	uint8_t unknown3[0x16];
	CEntityIdentity* m_pPrev; 	// 0x58
	CEntityIdentity* m_pNext; 	// 0x60
	CEntityIdentity* m_pPrevByClass; 	// 0x68
	CEntityIdentity* m_pNextByClass; 	// 0x70
};

// Alignment: 0
// Size: 0x8
class CEntityComponent
{
public:
	uint8_t unknown[8];
};

// Alignment: 1
// Size: 0x38
class CScriptComponent : public CEntityComponent
{
public:
	uint8_t unknown[0x28];
	CUtlSymbolLarge m_scriptClassName; 	// 0x30
};

// Alignment: 3
// Size: 0x30
class CEntityInstance : public IHandleEntity
{
public:
	virtual void *MaybeGetSchema();
	virtual uint64_t *IheUnk0(char a2);
	virtual int *IheUnk1(int *a2);
	
	virtual void *CeiUnk2();
	virtual void *CeiUnk3();
	virtual void Precache(int64_t *a2);
	virtual int64_t InitialSpawn();
	virtual void CeiUnk6(int64_t *a2);
	virtual void CeiUnk7();
	virtual void CeiUnk8(uint32_t a2, int64_t a3, int64_t a4);
	virtual void CeiUnk9();
	virtual bool CeiUnk10(int a2, int a3);
	virtual int64_t CeiReturnZero11();
	virtual int64_t CeiReturnZero12();
	virtual void CeiNullSub13();
	virtual bool CeiUnk14(int64_t a2);
	virtual void CeiUnk15(void *a2, int64_t a3, int a4);
	virtual int64_t CeiUnk16(int64_t a2);
	virtual int64_t CeiUnk17(void **a2);
	virtual bool CeiUnk18();
	virtual int64_t OnRestore();
	virtual int32_t CeiUnk20();
	virtual int *CeiUnk21(int *a2);
	virtual int64_t MaybeOnMemberChanged(int64_t memberOffset, int64_t a3, int64_t a4);
	virtual int64_t CeiUnk23(int64_t a2);
	virtual int64_t CeiUnk24(int64_t a2, int64_t a3);
	virtual bool CeiUnk25();
	virtual int16_t *CeiUnk26(int16_t *a2, int16_t *a3);
	virtual bool CeiUnk27();
	virtual bool CeiReturnZero28();
	virtual void **CeiUnk29(int64_t *a2);
	virtual int64_t *CeiUnk30();
	virtual void CeiUnk31();
	
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; 	// 0x8
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity *m_pEntity; 	// 0x10
	uint8_t unknown[0x10];
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent *m_CScriptComponent; 	// 0x28
};

// Alignment: 1
// Size: 0x1a0
class CNetworkTransmitComponent // : public 
{
public:
	uint8_t unknown0[0x16c];
	uint8_t m_nTransmitStateOwnedCounter; 	// 0x16c
	uint8_t unknown1[0x33];
};

// Size: 0x18
class CUtlVector // : public 
{
public:
	uint8_t unknown[0x18];
};

class CUtlString
{
public:
	char *m_pMemory;
};

// Alignment: 1
// Size: 0x28
class CEntityIOOutput
{
public:
	uint8_t unknown[0x28];
};

typedef uint64_t CNetworkedQuantizedFloat;

// Alignment: 3
// Size: 0x28
class CNetworkVelocityVector
{
public:
	uint8_t unknown[0x10];
	// MNetworkBitCount "18"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkVelocityVector"
	CNetworkedQuantizedFloat m_vecX; 	// 0x10
	// MNetworkBitCount "18"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkVelocityVector"
	CNetworkedQuantizedFloat m_vecY; 	// 0x18
	// MNetworkBitCount "18"
	// MNetworkMinValue "-4096"
	// MNetworkMaxValue "4096"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkVelocityVector"
	CNetworkedQuantizedFloat m_vecZ; 	// 0x20
};

// Alignment: 8
// Size: 0x30
class VPhysicsCollisionAttribute_t
{
public:
	uint8_t unknown0[8];
	// MNetworkEnable
	uint64_t m_nInteractsAs; 	// 0x8
	// MNetworkEnable
	uint64_t m_nInteractsWith; 	// 0x10
	// MNetworkEnable
	uint64_t m_nInteractsExclude; 	// 0x18
	// MNetworkEnable
	uint32_t m_nEntityId; 	// 0x20
	// MNetworkEnable
	uint32_t m_nOwnerId; 	// 0x24
	// MNetworkEnable
	uint16_t m_nHierarchyId; 	// 0x28
	// MNetworkEnable
	uint8_t m_nCollisionGroup; 	// 0x2a
	// MNetworkEnable
	uint8_t m_nCollisionFunctionMask; 	// 0x2b
	uint8_t unknown1[4];
};

// Alignment: 17
// Size: 0xb0
class CCollisionProperty
{
public:
	uint8_t unknown0[0x10];
	// MNetworkEnable
	// MNetworkChangeCallback "CollisionAttributeChanged"
	VPhysicsCollisionAttribute_t m_collisionAttribute; 	// 0x10
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMins; 	// 0x40
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateOBB"
	Vector m_vecMaxs; 	// 0x4c
	uint8_t unknown1[2];
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidFlags"
	uint8_t m_usSolidFlags; 	// 0x5a
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateSolidType"
	SolidType_t m_nSolidType; 	// 0x5b
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	uint8_t m_triggerBloat; 	// 0x5c
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	SurroundingBoundsType_t m_nSurroundType; 	// 0x5d
	// MNetworkEnable
	uint8_t m_CollisionGroup; 	// 0x5e
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpdateEnablePhysics"
	uint8_t m_nEnablePhysics; 	// 0x5f
	float m_flBoundingRadius; 	// 0x60
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMins; 	// 0x64
	// MNetworkEnable
	// MNetworkChangeCallback "MarkSurroundingBoundsDirty"
	Vector m_vecSpecifiedSurroundingMaxs; 	// 0x70
	Vector m_vecSurroundingMaxs; 	// 0x7c
	Vector m_vecSurroundingMins; 	// 0x88
	// MNetworkEnable
	Vector m_vCapsuleCenter1; 	// 0x94
	// MNetworkEnable
	Vector m_vCapsuleCenter2; 	// 0xa0
	// MNetworkEnable
	float m_flCapsuleRadius; 	// 0xac
};

// Alignment: 3
// Size: 0x28
class CNetworkViewOffsetVector
{
public:
	uint8_t unknown[0x10];
	// MNetworkBitCount "10"
	// MNetworkMinValue "-64"
	// MNetworkMaxValue "64"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkViewOffsetVector"
	CNetworkedQuantizedFloat m_vecX; 	// 0x10
	// MNetworkBitCount "10"
	// MNetworkMinValue "-64"
	// MNetworkMaxValue "64"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkViewOffsetVector"
	CNetworkedQuantizedFloat m_vecY; 	// 0x18
	// MNetworkBitCount "20"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "128"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "CNetworkViewOffsetVector"
	CNetworkedQuantizedFloat m_vecZ; 	// 0x20
};

typedef uint32_t CEntityHandle;

// Alignment: 2
// Size: 0x10
class CGameSceneNodeHandle
{
public:
	uint8_t unknown[0x8]; // 0x0
	// MNetworkEnable
	CEntityHandle m_hOwner; // 0x8	
	// MNetworkEnable
	CUtlStringToken m_name; // 0xc	
};

// Alignment: 7
// Size: 0x30
class CNetworkOriginCellCoordQuantizedVector
{
public:
	uint8_t unknown[0x10]; // 0x0
	// MNetworkEnable
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "cellx"
	uint16_t m_cellX; // 0x10	
	// MNetworkEnable
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "celly"
	uint16_t m_cellY; // 0x12	
	// MNetworkEnable
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "cellz"
	uint16_t m_cellZ; // 0x14	
	// MNetworkEnable
	uint16_t m_nOutsideWorld; // 0x16	
	// MNetworkBitCount "15"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1024.000000"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "posx"
	CNetworkedQuantizedFloat m_vecX; // 0x18	
	// MNetworkBitCount "15"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1024.000000"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "posy"
	CNetworkedQuantizedFloat m_vecY; // 0x20	
	// MNetworkBitCount "15"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1024.000000"
	// MNetworkEncodeFlags
	// MNetworkChangeCallback "OnCellChanged"
	// MNetworkPriority "31"
	// MNetworkSerializer "posz"
	CNetworkedQuantizedFloat m_vecZ; // 0x28	
};

// Alignment: 33
// Size: 0x150
class CGameSceneNode
{
public:
	uint8_t unknown0[0x10]; // 0x0
	// MNetworkDisable
	CTransform m_nodeToWorld; // 0x10	
	// MNetworkDisable
	CEntityInstance* m_pOwner; // 0x30	
	// MNetworkDisable
	CGameSceneNode* m_pParent; // 0x38	
	// MNetworkDisable
	CGameSceneNode* m_pChild; // 0x40	
	// MNetworkDisable
	CGameSceneNode* m_pNextSibling; // 0x48	
	uint8_t unknown1[0x20]; // 0x50
	// MNetworkEnable
	// MNetworkSerializer "gameSceneNode"
	// MNetworkChangeCallback "gameSceneNodeHierarchyParentChanged"
	// MNetworkPriority "32"
	// MNetworkVarEmbeddedFieldOffsetDelta "8"
	CGameSceneNodeHandle m_hParent; // 0x70	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Origin"
	// MNetworkChangeCallback "gameSceneNodeLocalOriginChanged"
	CNetworkOriginCellCoordQuantizedVector m_vecOrigin; // 0x80	
	uint8_t unknown2[0x8]; // 0xb0
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkSerializer "gameSceneNodeStepSimulationAnglesSerializer"
	// MNetworkChangeCallback "gameSceneNodeLocalAnglesChanged"
	Vector m_angRotation; // 0xb8	
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeLocalScaleChanged"
	// MNetworkPriority "32"
	float m_flScale; // 0xc4	
	// MNetworkDisable
	Vector m_vecAbsOrigin; // 0xc8	
	// MNetworkDisable
	Vector m_angAbsRotation; // 0xd4	
	// MNetworkDisable
	float m_flAbsScale; // 0xe0	
	// MNetworkDisable
	int16_t m_nParentAttachmentOrBone; // 0xe4	
	// MNetworkDisable
	bool m_bDebugAbsOriginChanges; // 0xe6	
	// MNetworkDisable
	bool m_bDormant; // 0xe7	
	// MNetworkDisable
	bool m_bForceParentToBeNetworked; // 0xe8	
	
	// MNetworkDisable
	uint8_t m_bDirtyHierarchy: 1; 		
	// MNetworkDisable
	uint8_t m_bDirtyBoneMergeInfo: 1; 		
	// MNetworkDisable
	uint8_t m_bNetworkedPositionChanged: 1; 		
	// MNetworkDisable
	uint8_t m_bNetworkedAnglesChanged: 1; 		
	// MNetworkDisable
	uint8_t m_bNetworkedScaleChanged: 1; 		
	// MNetworkDisable
	uint8_t m_bWillBeCallingPostDataUpdate: 1; 		
	// MNetworkDisable
	uint8_t m_bNotifyBoneTransformsChanged: 1; 		
	// MNetworkDisable
	uint8_t m_bBoneMergeFlex: 1; 		
	// MNetworkDisable
	uint8_t m_nLatchAbsOrigin: 2; 		
	// MNetworkDisable
	uint8_t m_bDirtyBoneMergeBoneToRoot: 1; 		
	// uint16_t __pad0: 13;
	
	// MNetworkDisable
	uint8_t m_nHierarchicalDepth; // 0xeb	
	// MNetworkDisable
	uint8_t m_nHierarchyType; // 0xec	
	// MNetworkDisable
	uint8_t m_nDoNotSetAnimTimeInInvalidatePhysicsCount; // 0xed	
	uint8_t unknown3[0x2]; // 0xee
	// MNetworkEnable
	CUtlStringToken m_name; // 0xf0	
	uint8_t unknown4[0x3c]; // 0xf4
	// MNetworkEnable
	// MNetworkChangeCallback "gameSceneNodeHierarchyAttachmentChanged"
	CUtlStringToken m_hierarchyAttachName; // 0x130	
	// MNetworkDisable
	float m_flZOffset; // 0x134	
	// MNetworkDisable
	Vector m_vRenderOrigin; // 0x138	
};

// Alignment: 2
// Size: 0x50
class CBodyComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	CGameSceneNode *m_pSceneNode; // 0x8	
	uint8_t unknown[0x10]; // 0x10
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x20	
};

// Alignment: 77
// Size: 0x4a0
class CBaseEntity : public CEntityInstance
{
public:
	virtual void *MaybeGetSchema();
	virtual uint64_t *IheUnk0(char a2);
	// virtual int *IheUnk1(int *a2);
	
	virtual void *CeiUnk2();
	virtual void *CeiUnk3();
	virtual void Precache(int64_t *a2);
	virtual int64_t InitialSpawn();
	virtual void CeiUnk6(int64_t *a2);
	// virtual void CeiUnk7();
	virtual void CeiUnk8(uint32_t a2, int64_t a3, int64_t a4);
	virtual void CeiUnk9();
	virtual bool CeiUnk10(int a2, int a3);
	// virtual int64_t CeiReturnZero11();
	// virtual int64_t CeiReturnZero12();
	// virtual void CeiNullSub13();
	virtual bool CeiUnk14(int64_t a2);
	virtual void CeiUnk15(void *a2, int64_t a3, int a4);
	virtual int64_t CeiUnk16(int64_t a2);
	virtual int64_t CeiUnk17(void **a2);
	virtual bool CeiUnk18();
	virtual int64_t OnRestore();
	virtual int32_t CeiUnk20();
	virtual int *CeiUnk21(int *a2);
	virtual int64_t MaybeOnMemberChanged(int64_t memberOffset, int64_t a3, int64_t a4);
	virtual int64_t CeiUnk23(int64_t a2);
	virtual int64_t CeiUnk24(int64_t a2, int64_t a3);
	virtual bool CeiUnk25();
	virtual int16_t *CeiUnk26(int16_t *a2, int16_t *a3);
	virtual bool CeiUnk27();
	// virtual bool CeiReturnZero28();
	// virtual void **CeiUnk29(int64_t *a2);
	virtual int64_t *CeiUnk30();
	virtual void CeiUnk31();
	
	virtual int64_t CbeUnk32();
	virtual bool CbeReturnZero33();
	virtual int64_t CbeUnk34(int64_t *a2);
	virtual int64_t CbeReturnZero35();
	virtual void CbeNullSub36();
	virtual int64_t *CbeUnk37(int64_t *a2, int64_t *a3);
	virtual void CbeUnk38(int64_t *a2);
	virtual void *CbeUnk39();
	virtual void *CbeUnk40();
	virtual int64_t CbeReturnZero41();
	virtual int64_t CbeReturnZero42();
	virtual int64_t CbeReturnZero43();
	virtual int64_t CbeReturnZero44();
	virtual int64_t CbeReturnZero45();
	virtual int64_t CbeReturnZero46();
	virtual bool CbeUnk47();
	virtual bool CbeUnk48();
	virtual int64_t CbeUnk49();
	virtual int64_t CbeUnk50();
	virtual int64_t *CbeUnk51(int64_t *a2, int64_t **a3);
	virtual void CbeUnk52();
	virtual void CbeUnk53();
	virtual void CbeUnk54();
	virtual bool CbeUnk55();
	virtual int64_t CbeUnk56();
	virtual int64_t CbeUnk57(int64_t a2);
	virtual int64_t CbeUnk58(int64_t a2);
	virtual void *CbeUnk59(void *a2);
	virtual CCollisionProperty *GetCollisionProperty();
	virtual bool CbeUnk61();
	virtual bool CbeReturnZero62();
	virtual void CbeUnk63(bool a2);
	virtual void CbeUnk64();
	virtual void VPhysicsUpdate(void *pPhysics);
	virtual int CbeUnk66(int64_t *a2, int a3);
	virtual bool CbeUnk67();
	virtual int64_t CbeUnk68(int64_t *a2);
	virtual void VPhysicsShadowCollision(int index, void *pEvent);
	virtual void CbeUnk70(int a2, int64_t a3);
	virtual void CbeNullSub71();
	virtual void CbeUnk72(float a2);
	virtual bool CbeReturnZero73();
	virtual void SetMoveType(MoveType_t moveType, MoveCollide_t moveCollide);
	virtual bool CbeUnk75(uint8_t a2);
	virtual Vector *CbeUnk76(Vector *a2);
	virtual void CbeNullSub77();
	virtual void CbeUnk78();
	virtual int64_t CbeUnk79();
	virtual int64_t CbeUnk80(void *a2);
	virtual int64_t CbeUnk81(void *a2, bool a3);
	virtual void CbeNullSub82();
	virtual CBaseEntity *CbeUnk83();
	virtual void CbeNullSub84();
	virtual int64_t MaybeChangeTeam(uint32_t teamNumber);
	virtual bool InSameTeam(CBaseEntity *pEntity);
	virtual void CbeUnk87(void *a2, uint32_t a3);
	virtual int64_t CbeReturnTwo88();
	virtual void *CbeReturnZero89();
	virtual void ***CbeUnk90();
	virtual int64_t CbeUnk91(char *a2, char *a3);
	virtual int64_t CbeReturnZero92();
	virtual bool CbeReturnZero93();
	virtual bool CbeReturnZero94();
	virtual bool CbeReturnZero95();
	virtual void AddContext(const char *contextNam);
	virtual char *CbeUnk97(char *a2);
	virtual void CbeUnk98();
	virtual void CbeNullSub99();
	virtual bool IsOnGround();
	virtual bool GetAutoAimRadius();
	virtual int64_t CbeUnk102(int64_t a2);
	virtual int64_t CbeUnk103(int64_t a2);
	virtual bool MaybePassesDamageFilter(void *takeDamageInfo);
	virtual bool CbeReturnOne105();
	virtual int TakeHealth(float flHealth);
	virtual float GetHealthFrac();
	virtual int64_t CbeUnk108(int64_t a2);
	virtual int64_t CbeUnk109(void *a2);
	virtual uint8_t CbeUnk110(void *a2, int64_t a3);
	virtual void Event_Killed(void *cTakeDamageInfo);
	virtual void Event_KilledOther(CBaseEntity *pVictim, void *cTakeDamageInfo);
	virtual bool CbeReturnOne113();
	virtual double CbeReturnZero114();
	virtual int CbeUnk115(void *a2, int64_t a3);
	virtual int ImpactTrace(void *pTrace, int iDamageType, char *pCustomImpactName);
	virtual bool CbeReturnZero117();
	virtual bool CbeUnk118(uint8_t **a2);
	virtual bool CbeReturnZero119();
	virtual bool CbeUnk120();
	virtual void OnEntityEvent(EntityEvent_t, int64_t nContents);
	virtual bool CbeUnk122(void *a2);
	virtual const char *CbeReturnZero123();
	virtual int64_t CbeUnk124(int64_t a2);
	virtual int64_t *CbeUnk125(int64_t a2);
	virtual int64_t *MaybeTouch(CBaseEntity *other);
	virtual int64_t *CbeUnk127(int64_t a2);
	virtual void CbeNullSub128();
	virtual int64_t *CbeUnk129(int64_t a2);
	virtual void CbeNullSub130();
	virtual int64_t CbeReturnZero131();
	virtual int64_t *CbeUnk132();
	virtual int64_t *CbeUnk133();
	virtual void CbeUnk134();
	virtual void CbeUnk135(); // possibly has a call to Physics_SimulateEntity inside it
	virtual void CbeNullSub136();
	virtual void CbeNullSub137();
	virtual void CbeUnk138(void *a2, Vector *velocity);
	virtual void CbeNullSub139();
	virtual int64_t CbeUnk140(int64_t a2, int64_t a3, Vector *a4);
	virtual bool CbeReturnOne141();
	virtual int32_t GetBloodColor();
	virtual bool MaybeIsDead();
	virtual bool IsAlive();
	virtual bool CbeReturnZero145();
	virtual int64_t CbeUnk146();
	virtual bool CbeReturnZero147();
	virtual bool CbeReturnZero148();
	virtual bool CbeUnk149();
	virtual int64_t CbeReturnZero150();
	virtual int64_t CbeReturnZero151();
	virtual bool CbeReturnZero152();
	virtual int64_t CbeReturnZero153();
	virtual bool CbeReturnZero154();
	virtual int64_t CbeReturnZero155();
	virtual int64_t CbeReturnZero156();
	virtual bool CbeReturnZero157();
	virtual int GetMaxHealth();
	virtual int SetHealth(int health);
	virtual void ModifyOrAppendCriteria(void *aiCriteriaSet);
	virtual int64_t CbeUnk161(char *a2);
	virtual void CbeNullSub162();
	virtual int64_t CbeReturnZero163();
	virtual double CbeReturnZero164();
	virtual void CbeNullSub165();
	virtual Vector *MaybeGetViewOffset(Vector *a2);
	virtual Vector *MaybeEyePosition(Vector *a2);
	virtual Vector *MaybeLocalEyeAngles(Vector *a2);
	virtual int64_t CbeUnk169(int64_t a2);
	virtual void SetTimeScale(float timescale);
	virtual Vector *CbeUnk171(Vector *a2, int64_t a3, bool a4);
	virtual int64_t CbeUnk172(int64_t a2);
	virtual CNetworkViewOffsetVector *CbeUnk173();
	virtual Vector *MaybeGetAbsVelocity2(Vector *a2);
	virtual bool MaybeHasBaseVelocity();
	virtual void CbeNullSub176();
	virtual void CbeUnk177(Vector *a2);
	virtual int64_t CbeUnk178();
	virtual bool CbeTraceSomething179(Vector *a2, int64_t *a3);
	virtual bool CbeTraceSomething180(Vector *a2, CBaseEntity *a3, CBaseEntity **a4);
	virtual bool CbeReturnOne181();
	virtual CBaseEntity *CbeUnk182();
	virtual bool CbeReturnZero183();
	virtual void CbeNullSub184();
	virtual int64_t CbeNullSub185(int64_t a2);
	virtual int32_t *MaybeScriptEmitSound(char *soundname);
	virtual bool CbeUnk187(int64_t a2, int32_t *a3);
	virtual bool CbeUnk188(int64_t a2, Vector *a3);
	virtual bool CbeUnk189(int32_t *a2, int64_t *a3);
	virtual void SetEffects(uint32_t nEffects);
	virtual bool CbeReturnOne191();
	virtual int64_t CbeReturnZero192();
	virtual int64_t CbeReturnZero193();
	virtual int32_t CbeUnk194();
	virtual bool CbeNullSub195(uint32_t a2);
	virtual void CbeNullSub196();
	virtual void CbeNullSub197();
	virtual bool CbeReturnZero198();
	virtual double CbeReturnZero199();
	virtual double CbeReturnZero200();
	virtual double CbeReturnZero201();
	virtual void CbeNullSub202();
	virtual void CbeNullSub203();
	virtual bool CbeReturnOne204();
	virtual void CbeNullSub205();
	
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "48"
	CBodyComponent *m_CBodyComponent; 	// 0x30
	CNetworkTransmitComponent m_NetworkTransmitComponent; 	// 0x38
	uint8_t unknown0[0x40];
	CUtlVector m_aThinkFunctions; 	// 0x218 CUtlVector< thinkfunc_t >
	int32_t m_iCurrentThinkContext; 	// 0x230
	int32_t m_nLastThinkTick; 	// 0x234
	uint8_t unknown[8];
	uint64_t m_isSteadyState; 	// 0x240
	float m_lastNetworkChange; 	// 0x248
	uint8_t unknown1[0xc];
	CUtlVector m_ResponseContexts; 	// 0x258
	CUtlSymbolLarge m_iszResponseContext; 	// 0x270
	uint8_t unknown2[0x20];
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	int32_t m_iHealth; 	// 0x298
	// MNetworkEnable
	int32_t m_iMaxHealth; 	// 0x29c
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	LifeState_t m_lifeState; 	// 0x2a0
	float m_flDamageAccumulator; 	// 0x2a4
	// MNetworkEnable
	bool m_bTakesDamage; 	// 0x2a8
	// MNetworkEnable
	TakeDamageFlags_t m_nTakeDamageFlags; 	// 0x2ac
	// MNetworkEnable
	uint8_t unknown3;
	MoveCollide_t m_MoveCollide; 	// 0x2b1
	// MNetworkEnable
	MoveType_t m_MoveType; 	// 0x2b2
	uint8_t m_nWaterTouch; 	// 0x2b3
	uint8_t m_nSlimeTouch; 	// 0x2b4
	bool m_bRestoreInHierarchy; 	// 0x2b5
	CUtlSymbolLarge m_target; 	// 0x2b8
	float m_flMoveDoneTime; 	// 0x2c0
	CHandle m_hDamageFilter; 	// 0x2c4
	CUtlSymbolLarge m_iszDamageFilterName; 	// 0x2c8
	// MNetworkEnable
	// MNetworkSendProxyRecipientsFilter
	CUtlStringToken m_nSubclassID; 	// 0x2d0
	uint8_t unknown4[12];
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	// MNetworkSendProxyRecipientsFilter
	float m_flAnimTime; 	// 0x2e0
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	float m_flSimulationTime; 	// 0x2e4
	// MNetworkEnable
	float m_flCreateTime; 	// 0x2e8
	// MNetworkEnable
	bool m_bClientSideRagdoll; 	// 0x2ec
	// MNetworkEnable
	uint8_t m_ubInterpolationFrame; 	// 0x2ed
	Vector m_vPrevVPhysicsUpdatePos; 	// 0x2f0
	// MNetworkEnable
	uint8_t m_iTeamNum; 	// 0x2fc
	CUtlSymbolLarge m_iGlobalname; 	// 0x300
	int32_t m_iSentToClients; 	// 0x308
	float m_flSpeed; 	// 0x30c
	CUtlString *m_sUniqueHammerID; 	// 0x310
	// MNetworkEnable
	uint32_t m_spawnflags; 	// 0x318
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_nNextThinkTick; 	// 0x31c
	int32_t m_nSimulationTick; 	// 0x320
	uint8_t unknown5[4];
	CEntityIOOutput m_OnKilled; 	// 0x328
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	EntityFlag_t m_fFlags; 	// 0x350
	Vector m_vecAbsVelocity; 	// 0x354
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkPriority "32"
	CNetworkVelocityVector m_vecVelocity; 	// 0x360
	uint8_t unknown6[8];
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	Vector m_vecBaseVelocity; 	// 0x390
	int32_t m_nPushEnumCount; 	// 0x39c
	CCollisionProperty *m_pCollision; 	// 0x3a0
	// MNetworkEnable
	CHandle m_hEffectEntity; 	// 0x3a8 // CHandle< CBaseEntity >
	// MNetworkEnable
	// MNetworkPriority "32"
	CHandle m_hOwnerEntity; 	// 0x3ac // CHandle< CBaseEntity >
	// MNetworkEnable
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; 	// 0x3b0
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CHandle m_hGroundEntity; 	// 0x3b4 // CHandle< CBaseEntity >
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "4"
	// MNetworkEncodeFlags
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; 	// 0x3b8
	// MNetworkEnable
	// MNetworkEncoder
	float m_flElasticity; 	// 0x3bc
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flGravityScale; 	// 0x3c0
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flTimeScale; 	// 0x3c4
	// MNetworkEnable
	// MNetworkUserGroup "Water"
	// MNetworkBitCount "8"
	// MNetworkMinValue "0"
	// MNetworkMaxValue "1"
	// MNetworkEncodeFlags
	float m_flWaterLevel; 	// 0x3c8
	// MNetworkEnable
	bool m_bSimulatedEveryTick; 	// 0x3cc
	// MNetworkEnable
	bool m_bAnimatedEveryTick; 	// 0x3cd
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMinCPULevel; 	// 0x3ce
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMaxCPULevel; 	// 0x3cf
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMinGPULevel; 	// 0x3d0
	// MNetworkEnable
	// MNetworkUserGroup "ScalabilityOptions"
	uint8_t m_nMaxGPULevel; 	// 0x3d1
	bool m_bDisableLowViolence; 	// 0x3d2
	uint8_t m_nWaterType; 	// 0x3d3
	int32_t m_iEFlags; 	// 0x3d4
	CEntityIOOutput m_OnUser1; 	// 0x3d8
	CEntityIOOutput m_OnUser2; 	// 0x400
	CEntityIOOutput m_OnUser3; 	// 0x428
	CEntityIOOutput m_OnUser4; 	// 0x450
	int32_t m_iInitialTeamNum; 	// 0x478
	// MNetworkEnable
	float m_flNavIgnoreUntilTime; 	// 0x47c
	Vector m_vecAngVelocity; 	// 0x480
	bool m_bNetworkQuantizeOriginAndAngles; 	// 0x48c
	bool m_bLagCompensate; 	// 0x48d
	float m_flOverriddenFriction; 	// 0x490
	CHandle m_pBlocker; 	// 0x494 CHandle< CBaseEntity >
	float m_flLocalTime; 	// 0x498
	float m_flVPhysicsUpdateLocalTime; 	// 0x49c
};

// Alignment: 5
// Size: 0xb8
class CRenderComponent : public CEntityComponent
{
public:
	uint8_t unknown0[8];
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x10
	uint8_t unknown1[0x18];
	bool m_bIsRenderingWithViewModels; 	// 0x50
	uint32_t m_nSplitscreenFlags; 	// 0x54
	uint8_t unknown2[8];
	bool m_bEnableRendering; 	// 0x60
	uint8_t unknown3[0x4f];
	bool m_bInterpolationReadyToDraw; 	// 0xb0
	uint8_t unknown4[7];
};

// Alignment: 1
// Size: 0x28
class CHitboxComponent : public CEntityComponent
{
public:
	uint8_t unknown[0x1c];
	// MNetworkEnable
	uint32_t m_bvDisabledHitGroups[1]; 	// 0x24
};

class Color
{
public:
	uint8_t r;
	uint8_t g;
	uint8_t b;
	uint8_t a;
};

class CUtlVectorEmbeddedNetworkVar
{
public:
	uint8_t unknown[0x50];
};


// Alignment: 11
// Size: 0x58
class CGlowProperty
{
public:
	uint8_t unknown0[8];
	Vector m_fGlowColor; 	// 0x8
	uint8_t unknown1[0x1C];
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowTypeChanged"
	int32_t m_iGlowType; 	// 0x30
	// MNetworkEnable
	int32_t m_iGlowTeam; 	// 0x34
	// MNetworkEnable
	int32_t m_nGlowRange; 	// 0x38
	// MNetworkEnable
	int32_t m_nGlowRangeMin; 	// 0x3c
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowColorChanged"
	Color m_glowColorOverride; 	// 0x40
	// MNetworkEnable
	bool m_bFlashing; 	// 0x44
	// MNetworkEnable
	float m_flGlowTime; 	// 0x48
	// MNetworkEnable
	float m_flGlowStartTime; 	// 0x4c
	// MNetworkEnable
	bool m_bEligibleForScreenHighlight; 	// 0x50
	bool m_bGlowing; 	// 0x51
	uint8_t unknown2[7];
};

// Size: 0x18
class CNetworkUtlVectorBase
{
public:
	uint8_t unknown[0x18];
};

// Alignment: 26
// Size: 0x6f0
class CBaseModelEntity : public CBaseEntity
{
public:
	virtual void *MaybeGetSchema();
	virtual uint64_t *IheUnk0(char a2);
	// virtual int *IheUnk1(int *a2);
	
	virtual void *CeiUnk2();
	virtual void *CeiUnk3();
	virtual void Precache(int64_t *a2);
	// virtual int64_t InitialSpawn();
	// virtual void CeiUnk6(int64_t *a2);
	// virtual void CeiUnk7();
	virtual void CeiUnk8(uint32_t a2, int64_t a3, int64_t a4);
	virtual void CeiUnk9();
	virtual bool CeiUnk10(int a2, int a3);
	// virtual int64_t CeiReturnZero11();
	// virtual int64_t CeiReturnZero12();
	// virtual void CeiNullSub13();
	// virtual bool CeiUnk14(int64_t a2);
	// virtual void CeiUnk15(void *a2, int64_t a3, int a4);
	virtual int64_t CeiUnk16(int64_t a2);
	// virtual int64_t CeiUnk17(void **a2);
	// virtual bool CeiUnk18();
	virtual int64_t OnRestore();
	// virtual int32_t CeiUnk20();
	// virtual int *CeiUnk21(int *a2);
	// virtual int64_t MaybeOnMemberChanged(int64_t memberOffset, int64_t a3, int64_t a4);
	// virtual int64_t CeiUnk23(int64_t a2);
	// virtual int64_t CeiUnk24(int64_t a2, int64_t a3);
	// virtual bool CeiUnk25();
	// virtual int16_t *CeiUnk26(int16_t *a2, int16_t *a3);
	// virtual bool CeiUnk27();
	// virtual bool CeiReturnZero28();
	// virtual void **CeiUnk29(int64_t *a2);
	virtual int64_t *CeiUnk30();
	virtual void CeiUnk31();
	
	virtual int64_t CbeUnk32();
	// virtual bool CbeReturnZero33();
	virtual int64_t CbeUnk34(int64_t *a2);
	// virtual int64_t CbeReturnZero35();
	// virtual void CbeNullSub36();
	virtual int64_t *CbeUnk37(int64_t *a2, int64_t *a3);
	// virtual void CbeUnk38(int64_t *a2);
	virtual void *CbeUnk39();
	virtual void *CbeUnk40();
	// virtual int64_t CbeReturnZero41();
	// virtual int64_t CbeReturnZero42();
	// virtual int64_t CbeReturnZero43();
	// virtual int64_t CbeReturnZero44();
	// virtual int64_t CbeReturnZero45();
	// virtual int64_t CbeReturnZero46();
	// virtual bool CbeUnk47();
	// virtual bool CbeUnk48();
	// virtual int64_t CbeUnk49();
	// virtual int64_t CbeUnk50();
	// virtual int64_t *CbeUnk51(int64_t *a2, int64_t **a3);
	// virtual void CbeUnk52();
	// virtual void CbeUnk53();
	// virtual void CbeUnk54();
	// virtual bool CbeUnk55();
	// virtual int64_t CbeUnk56();
	// virtual int64_t CbeUnk57(int64_t a2);
	// virtual int64_t CbeUnk58(int64_t a2);
	// virtual void *CbeUnk59(void *a2);
	// virtual CCollisionProperty *GetCollisionProperty();
	// virtual bool CbeUnk61();
	// virtual bool CbeReturnZero62();
	virtual void CbeUnk63(bool a2);
	// virtual void CbeUnk64();
	// virtual void VPhysicsUpdate(void *pPhysics);
	// virtual int CbeUnk66(int64_t *a2, int a3);
	// virtual bool CbeUnk67();
	// virtual int64_t CbeUnk68(int64_t *a2);
	// virtual void VPhysicsShadowCollision(int index, void *pEvent);
	// virtual void CbeUnk70(int a2, int64_t a3);
	// virtual void CbeNullSub71();
	// virtual void CbeUnk72(float a2);
	// virtual bool CbeReturnZero73();
	// virtual void SetMoveType(MoveType_t moveType, MoveCollide_t moveCollide);
	// virtual bool CbeUnk75(uint8_t a2);
	// virtual Vector *CbeUnk76(Vector *a2);
	// virtual void CbeNullSub77();
	// virtual void CbeUnk78();
	// virtual int64_t CbeUnk79();
	// virtual int64_t CbeUnk80(void *a2);
	// virtual int64_t CbeUnk81(void *a2, bool a3);
	// virtual void CbeNullSub82();
	// virtual CBaseEntity *CbeUnk83();
	// virtual void CbeNullSub84();
	// virtual int64_t MaybeChangeTeam(uint32_t teamNumber);
	// virtual bool InSameTeam(CBaseEntity *pEntity);
	// virtual void CbeUnk87(void *a2, uint32_t a3);
	// virtual int64_t CbeReturnTwo88();
	virtual void *CbeReturnZero89();
	// virtual void ***CbeUnk90();
	// virtual int64_t CbeUnk91(char *a2, char *a3);
	// virtual int64_t CbeReturnZero92();
	// virtual bool CbeReturnZero93();
	virtual bool CbeReturnZero94();
	// virtual bool CbeReturnZero95();
	// virtual void AddContext(const char *contextNam);
	// virtual char *CbeUnk97(char *a2);
	// virtual void CbeUnk98();
	// virtual void CbeNullSub99();
	// virtual bool IsOnGround();
	// virtual bool GetAutoAimRadius();
	// virtual int64_t CbeUnk102(int64_t a2);
	// virtual int64_t CbeUnk103(int64_t a2);
	// virtual bool MaybePassesDamageFilter(void *takeDamageInfo);
	// virtual bool CbeReturnOne105();
	// virtual int TakeHealth(float flHealth);
	// virtual float GetHealthFrac();
	// virtual int64_t CbeUnk108(int64_t a2);
	// virtual int64_t CbeUnk109(void *a2);
	virtual uint8_t CbeUnk110(void *a2, int64_t a3);
	// virtual void Event_Killed(void *cTakeDamageInfo);
	// virtual void Event_KilledOther(CBaseEntity *pVictim, void *cTakeDamageInfo);
	// virtual bool CbeReturnOne113();
	// virtual double CbeReturnZero114();
	// virtual int CbeUnk115(void *a2, int64_t a3);
	// virtual int ImpactTrace(void *pTrace, int iDamageType, char *pCustomImpactName);
	// virtual bool CbeReturnZero117();
	// virtual bool CbeUnk118(uint8_t **a2);
	// virtual bool CbeReturnZero119();
	// virtual bool CbeUnk120();
	// virtual void OnEntityEvent(EntityEvent_t, int64_t nContents);
	// virtual bool CbeUnk122(void *a2);
	// virtual const char *CbeReturnZero123();
	// virtual int64_t CbeUnk124(int64_t a2);
	// virtual int64_t *CbeUnk125(int64_t a2);
	// virtual int64_t *MaybeTouch(CBaseEntity *other);
	// virtual int64_t *CbeUnk127(int64_t a2);
	// virtual void CbeNullSub128();
	// virtual int64_t *CbeUnk129(int64_t a2);
	// virtual void CbeNullSub130();
	// virtual int64_t CbeReturnZero131();
	// virtual int64_t *CbeUnk132();
	// virtual int64_t *CbeUnk133();
	// virtual void CbeUnk134();
	// virtual void CbeUnk135(); // possibly has a call to Physics_SimulateEntity inside it
	// virtual void CbeNullSub136();
	// virtual void CbeNullSub137();
	// virtual void CbeUnk138(void *a2, Vector *velocity);
	// virtual void CbeNullSub139();
	// virtual int64_t CbeUnk140(int64_t a2, int64_t a3, Vector *a4);
	// virtual bool CbeReturnOne141();
	// virtual int32_t GetBloodColor();
	// virtual bool MaybeIsDead();
	// virtual bool IsAlive();
	// virtual bool CbeReturnZero145();
	// virtual int64_t CbeUnk146();
	// virtual bool CbeReturnZero147();
	// virtual bool CbeReturnZero148();
	// virtual bool CbeUnk149();
	// virtual int64_t CbeReturnZero150();
	// virtual int64_t CbeReturnZero151();
	// virtual bool CbeReturnZero152();
	// virtual int64_t CbeReturnZero153();
	// virtual bool CbeReturnZero154();
	// virtual int64_t CbeReturnZero155();
	// virtual int64_t CbeReturnZero156();
	// virtual bool CbeReturnZero157();
	// virtual int GetMaxHealth();
	// virtual int SetHealth(int health);
	// virtual void ModifyOrAppendCriteria(void *aiCriteriaSet);
	// virtual int64_t CbeUnk161(char *a2);
	// virtual void CbeNullSub162();
	// virtual int64_t CbeReturnZero163();
	// virtual double CbeReturnZero164();
	// virtual void CbeNullSub165();
	// virtual Vector *MaybeGetViewOffset(Vector *a2);
	// virtual Vector *MaybeEyePosition(Vector *a2);
	// virtual Vector *MaybeLocalEyeAngles(Vector *a2);
	// virtual int64_t CbeUnk169(int64_t a2);
	// virtual void SetTimeScale(float timescale);
	// virtual Vector *CbeUnk171(Vector *a2, int64_t a3, bool a4);
	// virtual int64_t CbeUnk172(int64_t a2);
	virtual CNetworkViewOffsetVector *CbeUnk173();
	// virtual Vector *MaybeGetAbsVelocity2(Vector *a2);
	// virtual bool MaybeHasBaseVelocity();
	// virtual void CbeNullSub176();
	// virtual void CbeUnk177(Vector *a2);
	// virtual int64_t CbeUnk178();
	// virtual bool CbeTraceSomething179(Vector *a2, int64_t *a3);
	// virtual bool CbeTraceSomething180(Vector *a2, CBaseEntity *a3, CBaseEntity **a4);
	// virtual bool CbeReturnOne181();
	// virtual CBaseEntity *CbeUnk182();
	// virtual bool CbeReturnZero183();
	// virtual void CbeNullSub184();
	// virtual int64_t CbeNullSub185(int64_t a2);
	// virtual int32_t *MaybeScriptEmitSound(char *soundname);
	// virtual bool CbeUnk187(int64_t a2, int32_t *a3);
	// virtual bool CbeUnk188(int64_t a2, Vector *a3);
	// virtual bool CbeUnk189(int32_t *a2, int64_t *a3);
	// virtual void SetEffects(uint32_t nEffects);
	// virtual bool CbeReturnOne191();
	// virtual int64_t CbeReturnZero192();
	// virtual int64_t CbeReturnZero193();
	// virtual int32_t CbeUnk194();
	// virtual bool CbeNullSub195(uint32_t a2);
	// virtual void CbeNullSub196();
	// virtual void CbeNullSub197();
	// virtual bool CbeReturnZero198();
	// virtual double CbeReturnZero199();
	// virtual double CbeReturnZero200();
	// virtual double CbeReturnZero201();
	// virtual void CbeNullSub202();
	// virtual void CbeNullSub203();
	// virtual bool CbeReturnOne204();
	// virtual void CbeNullSub205();
	
	virtual void CbmeUnk206();
	virtual void CbmeNullSub207();
	virtual const char *DamageDecal(int bitsDamageType, int gameMaterial);
	virtual bool CbmeReturnOne209();
	virtual void CbmeNullSub210();
	virtual bool CbmeUnk211();
	virtual void MaybeSetViewOffset(Vector *viewOffset);
	virtual bool IsRagdoll();
	virtual bool CbmeUnk214(int64_t a2, bool a3, int64_t a4, int a5, int64_t a6);
	virtual void CbmeUnk215(int64_t a2);
	virtual void CbmeUnk216(int64_t a2);
	virtual void Extinguish();
	virtual bool Dissolve(char *pMaterialName, float flStartTime, bool bNPCOnly, int nDissolveType, Vector *vDissolverOrigin, int iMagnitude);
	
	// MNetworkEnable
	// MNetworkUserGroup "CRenderComponent"
	// MNetworkAlias "CRenderComponent"
	// MNetworkTypeAlias "CRenderComponent"
	CRenderComponent* m_CRenderComponent; 	// 0x4a0
	// MNetworkEnable
	// MNetworkUserGroup "CHitboxComponent"
	// MNetworkAlias "CHitboxComponent"
	// MNetworkTypeAlias "CHitboxComponent"
	CHitboxComponent m_CHitboxComponent; 	// 0x4a8
	float m_flDissolveStartTime; 	// 0x4d0
	uint8_t unknown0[4];
	CEntityIOOutput m_OnIgnite; 	// 0x4d8
	// MNetworkEnable
	RenderMode_t m_nRenderMode; 	// 0x500
	// MNetworkEnable
	RenderFx_t m_nRenderFX; 	// 0x501
	bool m_bAllowFadeInView; 	// 0x502
	// MNetworkEnable
	// MNetworkChangeCallback "OnColorChanged"
	Color m_clrRender; 	// 0x503
	// MNetworkEnable
	// MNetworkChangeCallback "OnRenderAttributesChanged"
	CUtlVectorEmbeddedNetworkVar m_vecRenderAttributes; 	// 0x508 CUtlVectorEmbeddedNetworkVar< EntityRenderAttribute_t >
	// MNetworkEnable
	// MNetworkChangeCallback "OnLightGroupChanged"
	CUtlStringToken m_LightGroup; 	// 0x558
	// MNetworkEnable
	bool m_bRenderToCubemaps; 	// 0x55c
	// MNetworkEnable
	CCollisionProperty m_Collision; 	// 0x560
	// MNetworkEnable
	CGlowProperty m_Glow; 	// 0x610
	// MNetworkEnable
	float m_flGlowBackfaceMult; 	// 0x668
	// MNetworkEnable
	float m_fadeMinDist; 	// 0x66c
	// MNetworkEnable
	float m_fadeMaxDist; 	// 0x670
	// MNetworkEnable
	float m_flFadeScale; 	// 0x674
	// MNetworkEnable
	float m_flShadowStrength; 	// 0x678
	// MNetworkEnable
	uint8_t m_nObjectCulling; 	// 0x67c
	// MNetworkEnable
	int32_t m_nAddDecal; 	// 0x680
	// MNetworkEnable
	Vector m_vDecalPosition; 	// 0x684
	// MNetworkEnable
	Vector m_vDecalForwardAxis; 	// 0x690
	// MNetworkEnable
	float m_flDecalHealBloodRate; 	// 0x69c
	// MNetworkEnable
	float m_flDecalHealHeightRate; 	// 0x6a0
	// MNetworkEnable
	CNetworkUtlVectorBase m_ConfigEntitiesToPropagateMaterialDecalsTo; 	// 0x6a8 CNetworkUtlVectorBase< CHandle< CBaseModelEntity > >
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CNetworkViewOffsetVector m_vecViewOffset; 	// 0x6c0
	uint8_t unknown1[8];
};

// Alignment: 2
// Size: 0x48
class PhysicsRagdollPose_t
{
public:
	uint8_t unknown[8];
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; 	// 0x8
	// MNetworkEnable
	// MNetworkChangeCallback "OnTransformChanged"
	CNetworkUtlVectorBase m_Transforms; 	// 0x30 CNetworkUtlVectorBase< CTransform >
};

// Alignment: 0
// Size: 0x8
class IChoreoServices
{
public:
	uint8_t unknown[8];
};

// Alignment: 11
// Size: 0x820
class CBaseAnimGraph : public CBaseModelEntity
{
public:
	virtual void *MaybeGetSchema();
	virtual uint64_t *IheUnk0(char a2);
	// virtual int *IheUnk1(int *a2);
	
	virtual void *CeiUnk2();
	// virtual void *CeiUnk3();
	virtual void Precache(int64_t *a2);
	virtual int64_t InitialSpawn();
	virtual void CeiUnk6(int64_t *a2);
	virtual void CeiUnk7();
	virtual void CeiUnk8(uint32_t a2, int64_t a3, int64_t a4);
	virtual void CeiUnk9();
	virtual bool CeiUnk10(int a2, int a3);
	// virtual int64_t CeiReturnZero11();
	// virtual int64_t CeiReturnZero12();
	virtual void CeiNullSub13();
	// virtual bool CeiUnk14(int64_t a2);
	virtual void CeiUnk15(void *a2, int64_t a3, int a4);
	// virtual int64_t CeiUnk16(int64_t a2);
	virtual int64_t CeiUnk17(void **a2);
	// virtual bool CeiUnk18();
	// virtual int64_t OnRestore();
	// virtual int32_t CeiUnk20();
	// virtual int *CeiUnk21(int *a2);
	// virtual int64_t MaybeOnMemberChanged(int64_t memberOffset, int64_t a3, int64_t a4);
	// virtual int64_t CeiUnk23(int64_t a2);
	// virtual int64_t CeiUnk24(int64_t a2, int64_t a3);
	// virtual bool CeiUnk25();
	// virtual int16_t *CeiUnk26(int16_t *a2, int16_t *a3);
	// virtual bool CeiUnk27();
	// virtual bool CeiReturnZero28();
	// virtual void **CeiUnk29(int64_t *a2);
	virtual int64_t *CeiUnk30();
	virtual void CeiUnk31();
	
	virtual int64_t CbeUnk32();
	// virtual bool CbeReturnZero33();
	// virtual int64_t CbeUnk34(int64_t *a2);
	// virtual int64_t CbeReturnZero35();
	// virtual void CbeNullSub36();
	virtual int64_t *CbeUnk37(int64_t *a2, int64_t *a3);
	// virtual void CbeUnk38(int64_t *a2);
	// virtual void *CbeUnk39();
	// virtual void *CbeUnk40();
	virtual int64_t CbeReturnZero41();
	virtual int64_t CbeReturnZero42();
	// virtual int64_t CbeReturnZero43();
	// virtual int64_t CbeReturnZero44();
	virtual int64_t CbeReturnZero45();
	virtual int64_t CbeReturnZero46();
	virtual bool CbeUnk47();
	virtual bool CbeUnk48();
	virtual int64_t CbeUnk49();
	virtual int64_t CbeUnk50();
	virtual int64_t *CbeUnk51(int64_t *a2, int64_t **a3);
	virtual void CbeUnk52();
	virtual void CbeUnk53();
	virtual void CbeUnk54();
	// virtual bool CbeUnk55();
	// virtual int64_t CbeUnk56();
	// virtual int64_t CbeUnk57(int64_t a2);
	// virtual int64_t CbeUnk58(int64_t a2);
	// virtual void *CbeUnk59(void *a2);
	// virtual CCollisionProperty *GetCollisionProperty();
	// virtual bool CbeUnk61();
	// virtual bool CbeReturnZero62();
	// virtual void CbeUnk63(bool a2);
	// virtual void CbeUnk64();
	// virtual void VPhysicsUpdate(void *pPhysics);
	// virtual int CbeUnk66(int64_t *a2, int a3);
	// virtual bool CbeUnk67();
	virtual int64_t CbeUnk68(int64_t *a2);
	// virtual void VPhysicsShadowCollision(int index, void *pEvent);
	// virtual void CbeUnk70(int a2, int64_t a3);
	// virtual void CbeNullSub71();
	// virtual void CbeUnk72(float a2);
	// virtual bool CbeReturnZero73();
	// virtual void SetMoveType(MoveType_t moveType, MoveCollide_t moveCollide);
	// virtual bool CbeUnk75(uint8_t a2);
	// virtual Vector *CbeUnk76(Vector *a2);
	// virtual void CbeNullSub77();
	virtual void CbeUnk78();
	// virtual int64_t CbeUnk79();
	// virtual int64_t CbeUnk80(void *a2);
	virtual int64_t CbeUnk81(void *a2, bool a3);
	// virtual void CbeNullSub82();
	// virtual CBaseEntity *CbeUnk83();
	// virtual void CbeNullSub84();
	// virtual int64_t MaybeChangeTeam(uint32_t teamNumber);
	// virtual bool InSameTeam(CBaseEntity *pEntity);
	// virtual void CbeUnk87(void *a2, uint32_t a3);
	// virtual int64_t CbeReturnTwo88();
	// virtual void *CbeReturnZero89();
	// virtual void ***CbeUnk90();
	// virtual int64_t CbeUnk91(char *a2, char *a3);
	// virtual int64_t CbeReturnZero92();
	// virtual bool CbeReturnZero93();
	// virtual bool CbeReturnZero94();
	// virtual bool CbeReturnZero95();
	// virtual void AddContext(const char *contextNam);
	// virtual char *CbeUnk97(char *a2);
	// virtual void CbeUnk98();
	// virtual void CbeNullSub99();
	// virtual bool IsOnGround();
	// virtual bool GetAutoAimRadius();
	// virtual int64_t CbeUnk102(int64_t a2);
	// virtual int64_t CbeUnk103(int64_t a2);
	// virtual bool MaybePassesDamageFilter(void *takeDamageInfo);
	// virtual bool CbeReturnOne105();
	// virtual int TakeHealth(float flHealth);
	// virtual float GetHealthFrac();
	// virtual int64_t CbeUnk108(int64_t a2);
